# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,14, 23,27, 37,58]  # P4/16
  - [81,82, 135,169, 344,319]  # P5/32

# c2, k=3, s=1, p=None, g=1, compression=4, pool=None, act=True, attention=True, attention_k=3, attention_lite=True, batchnorm=True, dropout_rate=0, skip_tensor_in=None, skip_k=1, skip_channels=1, out_ratio=1

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
                  #c2, k=3, s=1, p=None, g=1, compression=4, pool=None, act=True, attention=True, attention_k=3, attention_lite=True, batchnorm=True, dropout_rate=0, skip_tensor_in=None, skip_k=1, skip_channels=1, out_ratio=1
  # [[-1, 1, EPConv, [32, 5, 1, 2, 1, 1, 2]],  # 0-P1/2
  #  [-1, 1, EPConv, [32, 3, 1, 1, 1, 4, 2]],  # 1-P2/4
  #  [[-1,0], 1, EPConv, [64, 3, 1, 1, 1, 4, 2, True, True, 3, True, True, 0, True, 1, 16, 2]],  # 2-P3/8
  #  [[-1,0], 1, EPConv, [128, 3, 1, 1, 1, 4, 2, True, True, 3, True, True, 0, True, 1, 16, 4]],  # 3-P4/16
  #  [[-1,0], 1, EPConv, [256, 3, 1, 1, 1, 4, 2, True, True, 3, True, True, 0, True, 1, 16, 8]],  # 4-P5/32
  #  [[-1,0], 1, EPConv, [512, 3, 1, 1, 1, 4, 2, True, True, 3, True, True, 0, True, 1, 16, 16]],  # 5-12
  
  [[-1, 1, EPConv, [64, 5, 2, 2, 1, 1]],  # 0-P1/2
   [-1, 1, EPConv, [128, 3, 2, 1, 1, 4]],  # 1-P2/4
   [[-1,0], 1, EPConv, [256, 3, 2, 1, 1, 6, False, True, True, 3, True, True, 0, True, 1, 16, 2]],  # 2-P3/8
   [[-1,0], 1, EPConv, [512, 3, 2,  1, 1, 6, False, True, True, 3, True, True, 0, True, 1, 16, 4]],  # 3-P4/16
   [[-1,0], 1, EPConv, [1024, 3, 2, 1, 1, 6, False, True, True, 3, True, True, 0, True, 1, 16, 8]],  # 4-P5/32
   [-1, 1, SPPF, [1024, 5]],  # 5
  ]

# YOLOv3-tiny head
head:
  [[-1, 1, EPConv, [1024, 3, 1, 1, 1, 6, False, True, True, 3, True, True, 0, True, 1, 16, 8]],
   [-1, 1, Conv, [256, 1, 1]], #7
   [-1, 1, EPConv, [512, 3, 1, 1, 1, 6, False, True, True, 3, True, True, 0, True, 1, 16, 8]],  # 8 (P5/32-large)

   [-2, 1, Conv, [128, 1, 1]], #9
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #10
   [[-1, 3], 1, Concat, [1]],  # 11 cat backbone P4
   [-1, 1, Conv, [256, 3, 1]],  # 12 (P4/16-medium)

   [[12, 8], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ]
