# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  #                    c2, k, s, p, g, com, pool, act, att, att_k, bn, do, skip_in, skip_k, skip_ch, out_res
  [[-1, 1, EPConv, [64, 6, 2, 2]],  # 0-P1/2
   #[-1, 1, EPConv, [128, 3, 1, 1, 1, 4, 2,]],  # 1-P2/4
   [-1, 1, EPConv, [128, 3, 2, 1]],  # 1-P2/4
   #[-1, 3, C3, [128]],
   #[[-1,0], 1, EPConv, [256, 3, 1, 1, 1, 4, 2, True, True, 1, True, 0, True, 1, 16, 2]],  # 2-P3/8
   [[-1,0], 1, EPConv, [256, 3, 2, 1, 1, 4, False, True, True, 1, True, 0, True, 1, 16, 2]],  # 2-P3/8
   #[-1, 6, C3, [256]],
   [[-1,0], 1, EPConv, [512, 3, 2,  1, 1, 4, False, True, True, 1, True, 0, True, 1, 16, 4]],  # 3-P4/16
   #[[-1,0], 1, EPConv, [512, 3, 1,  1, 1, 4, 2, True, True, 1, True, 0, True, 1, 16, 4]],  # 3-P4/16
   #[-1, 9, C3, [512]],
   [[-1,0], 1, EPConv, [1024, 3, 2, 1, 1, 4, False, True, True, 1, True, 0, True, 1, 16, 8]],  # 4-P5/32
   #[[-1,0], 1, EPConv, [1024, 3, 1, 1, 1, 4, 2, True, True, 1, True, 0, True, 1, 16, 8]],  # 4-P5/32
   #[-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 5
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, EPConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 9

   [-1, 1, EPConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 13 (P3/8-small)

   [-1, 1, EPConv, [256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 16 (P4/16-medium)

   [-1, 1, EPConv, [512, 3, 2]],
   [[-1, 6], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 19 (P5/32-large)

   [[13, 16, 19], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
